title: Suspicious Volume Shadow Copy Deletion (DarkSide Ransomware)
id: c947b146-0abc-4c87-9c64-b17e9d7274a2
status: experimental
description: Detects the deletion of Volume Shadow Copies via vssadmin.exe, a common precursor to ransomware encryption as seen in the Colonial Pipeline incident.
author: Benedict M. Garcia (benben000000)
date: 2026-04-24
tags:
    - attack.impact
    - attack.t1490
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\vssadmin.exe'
        CommandLine|contains|all:
            - 'delete'
            - 'shadows'
    condition: selection
falsepositives:
    - Legitimate administrative backup scripts.
level: critical
